import os
print("""\033[36m
░█████╗░██╗░░░░░██╗░█████╗░░██████╗██████╗░
██╔══██╗██║░░░░░██║██╔══██╗██╔════╝██╔══██╗
███████║██║░░░░░██║███████║╚█████╗░██████╔╝
██╔══██║██║░░░░░██║██╔══██║░╚═══██╗██╔══██╗
██║░░██║███████╗██║██║░░██║██████╔╝██║░░██║
╚═╝░░╚═╝╚══════╝╚═╝╚═╝░░╚═╝╚═════╝░╚═╝░░╚═╝""")
name=input("\033[33mВведите имя Алиаса:")
use=input("Введите функцию алиаса в кавычках")
alias="alias "+name+"="+use
with open('bash.bashrc', 'w') as fp:
    fp.write(alias)
os.system("rm -f /$PREFIX/etc/bash.bashrc")
os.system("mv bash.bashrc /$PREFIX/etc/")
    	