import os
print("""\033[31m

░█████╗░██╗░░░░░██╗░█████╗░░██████╗██████╗░
██╔══██╗██║░░░░░██║██╔══██╗██╔════╝██╔══██╗
███████║██║░░░░░██║███████║╚█████╗░██████╔╝
██╔══██║██║░░░░░██║██╔══██║░╚═══██╗██╔══██╗
██║░░██║███████╗██║██║░░██║██████╔╝██║░░██║
╚═╝░░╚═╝╚══════╝╚═╝╚═╝░░╚═╝╚═════╝░╚═╝░░╚═╝
""")
import os
xaker = input("""\033[35m[1]Android
[2]Linux
Выберите параметр:""")
if xaker == "1":
    os.system("clear")
    os.system("python core/alias/ALIAS.py")
elif xaker == "2":
       os.system("clear")
       os.system("python core/alias/ALIASL.py")